In [9]:
import numpy as np
import pandas as pd
from sklearn.model_selection import StratifiedKFold

In [17]:
a = pd.DataFrame()
a["path"] = ["{}".format(i) for i in range(50)]
a["label"] = [i for i in range(5) for j in range(10)]

In [18]:
a.label.values

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4,
       4, 4, 4, 4, 4, 4])

In [19]:
np.arange(a.shape[0])

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49])

In [28]:
folds = StratifiedKFold(n_splits=3).split(np.arange(a.shape[0]), a.label.values)

In [29]:
for fold, (tr, val) in enumerate(folds):
    print(fold, tr, val)

0 [ 4  5  6  7  8  9 13 14 15 16 17 18 19 23 24 25 26 27 28 29 34 35 36 37
 38 39 43 44 45 46 47 48 49] [ 0  1  2  3 10 11 12 20 21 22 30 31 32 33 40 41 42]
1 [ 0  1  2  3  7  8  9 10 11 12 17 18 19 20 21 22 26 27 28 29 30 31 32 33
 37 38 39 40 41 42 47 48 49] [ 4  5  6 13 14 15 16 23 24 25 34 35 36 43 44 45 46]
2 [ 0  1  2  3  4  5  6 10 11 12 13 14 15 16 20 21 22 23 24 25 30 31 32 33
 34 35 36 40 41 42 43 44 45 46] [ 7  8  9 17 18 19 26 27 28 29 37 38 39 47 48 49]

In [30]:
a.label.nunique()

5

In [31]:
col_list = [
    "apple",
    "banana",
    "circle"
]

df_a = pd.DataFrame()
df_b = pd.DataFrame()
df_c = pd.DataFrame()

for col in col_list:
    df_a[col] = range(6)
    df_b[col] = range(6, 12)
    df_c[col] = range(12,18)

In [34]:
df = pd.concat([df_a, df_b], axis=1)

In [38]:
df["apple"]

   apple  apple
0      0      6
1      1      7
2      2      8
3      3      9
4      4     10
5      5     11

In [43]:
(df_a + df_b)/3

      apple    banana    circle
0  2.000000  2.000000  2.000000
1  2.666667  2.666667  2.666667
2  3.333333  3.333333  3.333333
3  4.000000  4.000000  4.000000
4  4.666667  4.666667  4.666667
5  5.333333  5.333333  5.333333

In [54]:
a = df_a["apple"]
a[[0,1]]

0    0
1    1
Name: apple, dtype: int64

In [4]:
a = {}
for i in range(5):
    a[i] = i +5